<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b5e205c9b30e4a55e893d75ae187192e727f4ef4317e2311ffe64ab84cb0ae66","plan_job_ref":"Job Environment Main - Plan #1881 at https://github.com/jarrod-lowe/wildsea/actions/runs/18253958261","plan_out_hash":"134b6adb6f0c06733caeaa14e468077c8585d072d6156fce2f1ae54c1e0df043","plan_hash":"f453d18062cc484a7ddf24c4e4c3548ba3d5b849663d6bf12ea4cf128723a3b6","plan_text_format":"diff-trunc","version":"2.2.2"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
domain_name          = "wildsea.lowe.kiwi"
environment          = "primary"
google_client_id     = (sensitive value)
google_client_secret = (sensitive value)
saml_metadata_url    = (sensitive value)
sns_alarm_topic_arn  = "arn:aws:sns:ap-southeast-2:453430506965:Pushover"
```
</details>
<details>
<summary>Plan: 22 to add, 8 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.asset_promotions_pipe will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "asset_promotions_pipe" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "sqs:DeleteMessage",
+               "sqs:GetQueueAttributes",
+               "sqs:ReceiveMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
        }
+       statement {
+           actions   = [
+               "states:StartSyncExecution",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:states:ap-southeast-2:021891603679:stateMachine:Wildsea-primary-asset-path-parser",
            ]
        }
+       statement {
+           actions   = [
+               "events:PutEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:events:ap-southeast-2:021891603679:event-bus/Wildsea-primary",
            ]
        }
+       statement {
+           actions   = [
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
        }
    }

  # module.wildsea.data.aws_iam_policy_document.asset_promotions_queue will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "asset_promotions_queue" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "sqs:SendMessage",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowS3ToSendMessages"

+           condition {
+               test     = "ArnEquals"
+               values   = [
+                   "arn:aws:s3:::wildsea-primary-assets",
                ]
+               variable = "aws:SourceArn"
            }
+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "021891603679",
                ]
+               variable = "aws:SourceAccount"
            }

+           principals {
+               identifiers = [
+                   "s3.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.wildsea.data.aws_iam_policy_document.deleter_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deleter_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.data.aws_iam_policy_document.expire_asset_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "expire_asset_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/_expireAsset",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.data.aws_iam_policy_document.finalise_asset_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "finalise_asset_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/_finaliseAsset",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.data.aws_iam_policy_document.move_asset_pipe will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "move_asset_pipe" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "dynamodb:DescribeStream",
+               "dynamodb:GetRecords",
+               "dynamodb:GetShardIterator",
+               "dynamodb:ListStreams",
            ]
+           resources = [
+               "arn:aws:dynamodb:ap-southeast-2:021891603679:table/Wildsea-primary/stream/2025-09-28T02:27:27.095",
            ]
+           sid       = "ReadStream"
        }
+       statement {
+           actions   = [
+               "states:StartExecution",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "InvokeStepFunction"
        }
+       statement {
+           actions   = [
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "WriteLogs"
        }
    }

  # module.wildsea.data.aws_iam_policy_document.promote_asset_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "promote_asset_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/_promoteAsset",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.aws_appsync_function.function["requestAssetUpload"] will be updated in-place
!~  resource "aws_appsync_function" "function" {
!~      code                      = <<-EOT
            // function/requestAssetUpload/requestAssetUpload.ts
            import { util } from "@aws-appsync/utils";
            
            // environment.json
            var environment_default = { name: "primary" };
            
            // lib/constants/entityTypes.ts
            var TypeAsset = "ASSET";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixSection = "SECTION";
            var DDBPrefixAsset = "ASSET";
            
            // lib/constants/assetStatus.ts
            var ASSET_STATUS_PENDING = "PENDING";
            
            // lib/constants/assets.ts
            var MAX_ASSET_SIZE_BYTES = 0;
            var ASSET_CLEANUP_TIMEOUT_SECONDS = 30;
            var ALLOWED_ASSET_MIME_TYPES = [
              "image/jpeg",
              "image/png",
              "image/gif",
              "image/webp"
            ];
            
            // function/requestAssetUpload/requestAssetUpload.ts
            function request(context) {
              if (!context.identity) util.unauthorized();
              const identity = context.identity;
              if (!identity?.sub) util.unauthorized();
              const input = context.arguments.input;
              const assetId = util.autoId();
              const timestamp = util.time.nowISO8601();
              const expireUploadAtSeconds = util.time.nowEpochSeconds() + ASSET_CLEANUP_TIMEOUT_SECONDS;
              const expireUploadAt = util.time.epochMilliSecondsToISO8601(
                expireUploadAtSeconds * 1e3
              );
              if (!ALLOWED_ASSET_MIME_TYPES.includes(input.mimeType)) {
                util.error(
                  "Invalid mime type. Only images are allowed.",
                  "InvalidMimeType"
                );
              }
              if (input.sizeBytes > MAX_ASSET_SIZE_BYTES) {
                util.error(
                  `File size too large. Maximum ${MAX_ASSET_SIZE_BYTES / (1024 * 1024)}MB allowed.`,
                  "FileTooLarge"
                );
              }
              const bucket = `wildsea-${environment_default.name}-assets`;
              const incomingKey = `incoming/game/${input.gameId}/section/${input.sectionId}/${assetId}/original`;
              const originalKey = `asset/game/${input.gameId}/section/${input.sectionId}/${assetId}/original`;
              const variantsPrefix = `asset/game/${input.gameId}/section/${input.sectionId}/${assetId}/variants/`;
              const assetData = {
                gameId: input.gameId,
                sectionId: input.sectionId,
                assetId,
                label: input.label || void 0,
                status: ASSET_STATUS_PENDING,
                bucket,
                incomingKey,
                originalKey,
                variantsPrefix,
                mimeType: input.mimeType,
                sizeBytes: input.sizeBytes,
                createdAt: timestamp,
                updatedAt: timestamp,
                expireUploadAt,
                type: TypeAsset
              };
              const assetItem = {
                operation: "PutItem",
                table: "Wildsea-" + environment_default.name,
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixAsset + "#" + assetId
                }),
                attributeValues: util.dynamodb.toMapValues(assetData)
              };
              const gameItem = {
                operation: "UpdateItem",
                table: "Wildsea-" + environment_default.name,
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixGame
                }),
                update: {
                  expression: "SET #updatedAt = :updatedAt, #remainingAssets = #remainingAssets - :one",
                  expressionNames: {
                    "#updatedAt": "updatedAt",
                    "#remainingAssets": "remainingAssets"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":updatedAt": timestamp,
                    ":one": 1
                  })
                },
                condition: {
                  expression: "#remainingAssets > :zero",
                  expressionNames: {
                    "#remainingAssets": "remainingAssets"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":zero": 0
                  }),
                  returnValuesOnConditionCheckFailure: false
                }
              };
              const sectionItem = {
                operation: "UpdateItem",
                table: "Wildsea-" + environment_default.name,
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixSection + "#" + input.sectionId
                }),
                update: {
                  expression: "SET #updatedAt = :updatedAt, #assets = list_append(if_not_exists(#assets, :emptyList), :assetList)",
                  expressionNames: {
                    "#updatedAt": "updatedAt",
                    "#assets": "assets"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":updatedAt": timestamp,
                    ":emptyList": [],
                    ":assetList": [assetId]
                  })
                },
                condition: {
                  expression: "#userId = :userId",
                  expressionNames: {
                    "#userId": "userId"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":userId": identity.sub
                  }),
                  returnValuesOnConditionCheckFailure: false
                }
              };
              context.stash.assetData = assetData;
              context.stash.input = input;
              return {
                operation: "TransactWriteItems",
                transactItems: [assetItem, gameItem, sectionItem]
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return {
                assetData: context.stash.assetData,
                input: context.stash.input
              };
            }
            export {
              request,
              response
            };
          - //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsicmVxdWVzdEFzc2V0VXBsb2FkLnRzIiwgIi4uLy4uL2Vudmlyb25tZW50Lmpzb24iLCAiLi4vLi4vbGliL2NvbnN0YW50cy9lbnRpdHlUeXBlcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2RiUHJlZml4ZXMudHMiLCAiLi4vLi4vbGliL2NvbnN0YW50cy9hc3NldFN0YXR1cy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2Fzc2V0cy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDOzs7QUNBdEQsNEJBQUMsTUFBTyxVQUFTOzs7QUNTVixJQUFNLFlBQVk7OztBQ1RsQixJQUFNLGdCQUFnQjtBQUN0QixJQUFNLG1CQUFtQjtBQVd6QixJQUFNLGlCQUFpQjs7O0FDWHZCLElBQU0sdUJBQXVCOzs7QUNFN0IsSUFBTSx1QkFBdUI7QUFHN0IsSUFBTSxnQ0FBZ0M7QUFRdEMsSUFBTSwyQkFBMkI7QUFBQSxFQUN0QztBQUFBLEVBQ0E7QUFBQSxFQUNBO0FBQUEsRUFDQTtBQUNGOzs7QUxETyxTQUFTLFFBQ2QsU0FDbUM7QUFDbkMsTUFBSSxDQUFDLFFBQVEsU0FBVSxNQUFLLGFBQWE7QUFDekMsUUFBTSxXQUFXLFFBQVE7QUFDekIsTUFBSSxDQUFDLFVBQVUsSUFBSyxNQUFLLGFBQWE7QUFFdEMsUUFBTSxRQUFRLFFBQVEsVUFBVTtBQUNoQyxRQUFNLFVBQVUsS0FBSyxPQUFPO0FBQzVCLFFBQU0sWUFBWSxLQUFLLEtBQUssV0FBVztBQUd2QyxRQUFNLHdCQUNKLEtBQUssS0FBSyxnQkFBZ0IsSUFBSTtBQUNoQyxRQUFNLGlCQUFpQixLQUFLLEtBQUs7QUFBQSxJQUMvQix3QkFBd0I7QUFBQSxFQUMxQjtBQUdBLE1BQUksQ0FBQyx5QkFBeUIsU0FBUyxNQUFNLFFBQVEsR0FBRztBQUN0RCxTQUFLO0FBQUEsTUFDSDtBQUFBLE1BQ0E7QUFBQSxJQUNGO0FBQUEsRUFDRjtBQUdBLE1BQUksTUFBTSxZQUFZLHNCQUFzQjtBQUMxQyxTQUFLO0FBQUEsTUFDSCxnQ0FBZ0Msd0JBQXdCLE9BQU8sS0FBSztBQUFBLE1BQ3BFO0FBQUEsSUFDRjtBQUFBLEVBQ0Y7QUFFQSxRQUFNLFNBQVMsV0FBVyxvQkFBWSxJQUFJO0FBQzFDLFFBQU0sY0FBYyxpQkFBaUIsTUFBTSxNQUFNLFlBQVksTUFBTSxTQUFTLElBQUksT0FBTztBQUN2RixRQUFNLGNBQWMsY0FBYyxNQUFNLE1BQU0sWUFBWSxNQUFNLFNBQVMsSUFBSSxPQUFPO0FBQ3BGLFFBQU0saUJBQWlCLGNBQWMsTUFBTSxNQUFNLFlBQVksTUFBTSxTQUFTLElBQUksT0FBTztBQUd2RixRQUFNLFlBQXVCO0FBQUEsSUFDM0IsUUFBUSxNQUFNO0FBQUEsSUFDZCxXQUFXLE1BQU07QUFBQSxJQUNqQjtBQUFBLElBQ0EsT0FBTyxNQUFNLFNBQVM7QUFBQSxJQUN0QixRQUFRO0FBQUEsSUFDUjtBQUFBLElBQ0E7QUFBQSxJQUNBO0FBQUEsSUFDQTtBQUFBLElBQ0EsVUFBVSxNQUFNO0FBQUEsSUFDaEIsV0FBVyxNQUFNO0FBQUEsSUFDakIsV0FBVztBQUFBLElBQ1gsV0FBVztBQUFBLElBQ1g7QUFBQSxJQUNBLE1BQU07QUFBQSxFQUNSO0FBRUEsUUFBTSxZQUFZO0FBQUEsSUFDaEIsV0FBVztBQUFBLElBQ1gsT0FBTyxhQUFhLG9CQUFZO0FBQUEsSUFDaEMsS0FBSyxLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQzdCLElBQUksZ0JBQWdCLE1BQU0sTUFBTTtBQUFBLE1BQ2hDLElBQUksaUJBQWlCLE1BQU07QUFBQSxJQUM3QixDQUFDO0FBQUEsSUFDRCxpQkFBaUIsS0FBSyxTQUFTLFlBQVksU0FBUztBQUFBLEVBQ3REO0FBR0EsUUFBTSxXQUFXO0FBQUEsSUFDZixXQUFXO0FBQUEsSUFDWCxPQUFPLGFBQWEsb0JBQVk7QUFBQSxJQUNoQyxLQUFLLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxnQkFBZ0IsTUFBTSxNQUFNO0FBQUEsTUFDaEMsSUFBSTtBQUFBLElBQ04sQ0FBQztBQUFBLElBQ0QsUUFBUTtBQUFBLE1BQ04sWUFDRTtBQUFBLE1BQ0YsaUJBQWlCO0FBQUEsUUFDZixjQUFjO0FBQUEsUUFDZCxvQkFBb0I7QUFBQSxNQUN0QjtBQUFBLE1BQ0Esa0JBQWtCLEtBQUssU0FBUyxZQUFZO0FBQUEsUUFDMUMsY0FBYztBQUFBLFFBQ2QsUUFBUTtBQUFBLE1BQ1YsQ0FBQztBQUFBLElBQ0g7QUFBQSxJQUNBLFdBQVc7QUFBQSxNQUNULFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2Ysb0JBQW9CO0FBQUEsTUFDdEI7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLFNBQVM7QUFBQSxNQUNYLENBQUM7QUFBQSxNQUNELHFDQUFxQztBQUFBLElBQ3ZDO0FBQUEsRUFDRjtBQUdBLFFBQU0sY0FBYztBQUFBLElBQ2xCLFdBQVc7QUFBQSxJQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNLE1BQU07QUFBQSxNQUNoQyxJQUFJLG1CQUFtQixNQUFNLE1BQU07QUFBQSxJQUNyQyxDQUFDO0FBQUEsSUFDRCxRQUFRO0FBQUEsTUFDTixZQUNFO0FBQUEsTUFDRixpQkFBaUI7QUFBQSxRQUNmLGNBQWM7QUFBQSxRQUNkLFdBQVc7QUFBQSxNQUNiO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxjQUFjO0FBQUEsUUFDZCxjQUFjLENBQUM7QUFBQSxRQUNmLGNBQWMsQ0FBQyxPQUFPO0FBQUEsTUFDeEIsQ0FBQztBQUFBLElBQ0g7QUFBQSxJQUNBLFdBQVc7QUFBQSxNQUNULFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2YsV0FBVztBQUFBLE1BQ2I7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLFdBQVcsU0FBUztBQUFBLE1BQ3RCLENBQUM7QUFBQSxNQUNELHFDQUFxQztBQUFBLElBQ3ZDO0FBQUEsRUFDRjtBQUdBLFVBQVEsTUFBTSxZQUFZO0FBQzFCLFVBQVEsTUFBTSxRQUFRO0FBRXRCLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLGVBQWUsQ0FBQyxXQUFXLFVBQVUsV0FBVztBQUFBLEVBQ2xEO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBMkI7QUFDbEQsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBR0EsU0FBTztBQUFBLElBQ0wsV0FBVyxRQUFRLE1BQU07QUFBQSxJQUN6QixPQUFPLFFBQVEsTUFBTTtBQUFBLEVBQ3ZCO0FBQ0Y7IiwKICAibmFtZXMiOiBbXQp9Cg==
          + //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsicmVxdWVzdEFzc2V0VXBsb2FkLnRzIiwgIi4uLy4uL2Vudmlyb25tZW50Lmpzb24iLCAiLi4vLi4vbGliL2NvbnN0YW50cy9lbnRpdHlUeXBlcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2RiUHJlZml4ZXMudHMiLCAiLi4vLi4vbGliL2NvbnN0YW50cy9hc3NldFN0YXR1cy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2Fzc2V0cy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDOzs7QUNBdEQsNEJBQUMsTUFBTyxVQUFTOzs7QUNTVixJQUFNLFlBQVk7OztBQ1RsQixJQUFNLGdCQUFnQjtBQUN0QixJQUFNLG1CQUFtQjtBQVd6QixJQUFNLGlCQUFpQjs7O0FDWHZCLElBQU0sdUJBQXVCOzs7QUNFN0IsSUFBTSx1QkFBdUI7QUFHN0IsSUFBTSxnQ0FBZ0M7QUFZdEMsSUFBTSwyQkFBMkI7QUFBQSxFQUN0QztBQUFBLEVBQ0E7QUFBQSxFQUNBO0FBQUEsRUFDQTtBQUNGOzs7QUxMTyxTQUFTLFFBQ2QsU0FDbUM7QUFDbkMsTUFBSSxDQUFDLFFBQVEsU0FBVSxNQUFLLGFBQWE7QUFDekMsUUFBTSxXQUFXLFFBQVE7QUFDekIsTUFBSSxDQUFDLFVBQVUsSUFBSyxNQUFLLGFBQWE7QUFFdEMsUUFBTSxRQUFRLFFBQVEsVUFBVTtBQUNoQyxRQUFNLFVBQVUsS0FBSyxPQUFPO0FBQzVCLFFBQU0sWUFBWSxLQUFLLEtBQUssV0FBVztBQUd2QyxRQUFNLHdCQUNKLEtBQUssS0FBSyxnQkFBZ0IsSUFBSTtBQUNoQyxRQUFNLGlCQUFpQixLQUFLLEtBQUs7QUFBQSxJQUMvQix3QkFBd0I7QUFBQSxFQUMxQjtBQUdBLE1BQUksQ0FBQyx5QkFBeUIsU0FBUyxNQUFNLFFBQVEsR0FBRztBQUN0RCxTQUFLO0FBQUEsTUFDSDtBQUFBLE1BQ0E7QUFBQSxJQUNGO0FBQUEsRUFDRjtBQUdBLE1BQUksTUFBTSxZQUFZLHNCQUFzQjtBQUMxQyxTQUFLO0FBQUEsTUFDSCxnQ0FBZ0Msd0JBQXdCLE9BQU8sS0FBSztBQUFBLE1BQ3BFO0FBQUEsSUFDRjtBQUFBLEVBQ0Y7QUFFQSxRQUFNLFNBQVMsV0FBVyxvQkFBWSxJQUFJO0FBQzFDLFFBQU0sY0FBYyxpQkFBaUIsTUFBTSxNQUFNLFlBQVksTUFBTSxTQUFTLElBQUksT0FBTztBQUN2RixRQUFNLGNBQWMsY0FBYyxNQUFNLE1BQU0sWUFBWSxNQUFNLFNBQVMsSUFBSSxPQUFPO0FBQ3BGLFFBQU0saUJBQWlCLGNBQWMsTUFBTSxNQUFNLFlBQVksTUFBTSxTQUFTLElBQUksT0FBTztBQUd2RixRQUFNLFlBQXVCO0FBQUEsSUFDM0IsUUFBUSxNQUFNO0FBQUEsSUFDZCxXQUFXLE1BQU07QUFBQSxJQUNqQjtBQUFBLElBQ0EsT0FBTyxNQUFNLFNBQVM7QUFBQSxJQUN0QixRQUFRO0FBQUEsSUFDUjtBQUFBLElBQ0E7QUFBQSxJQUNBO0FBQUEsSUFDQTtBQUFBLElBQ0EsVUFBVSxNQUFNO0FBQUEsSUFDaEIsV0FBVyxNQUFNO0FBQUEsSUFDakIsV0FBVztBQUFBLElBQ1gsV0FBVztBQUFBLElBQ1g7QUFBQSxJQUNBLE1BQU07QUFBQSxFQUNSO0FBRUEsUUFBTSxZQUFZO0FBQUEsSUFDaEIsV0FBVztBQUFBLElBQ1gsT0FBTyxhQUFhLG9CQUFZO0FBQUEsSUFDaEMsS0FBSyxLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQzdCLElBQUksZ0JBQWdCLE1BQU0sTUFBTTtBQUFBLE1BQ2hDLElBQUksaUJBQWlCLE1BQU07QUFBQSxJQUM3QixDQUFDO0FBQUEsSUFDRCxpQkFBaUIsS0FBSyxTQUFTLFlBQVksU0FBUztBQUFBLEVBQ3REO0FBR0EsUUFBTSxXQUFXO0FBQUEsSUFDZixXQUFXO0FBQUEsSUFDWCxPQUFPLGFBQWEsb0JBQVk7QUFBQSxJQUNoQyxLQUFLLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxnQkFBZ0IsTUFBTSxNQUFNO0FBQUEsTUFDaEMsSUFBSTtBQUFBLElBQ04sQ0FBQztBQUFBLElBQ0QsUUFBUTtBQUFBLE1BQ04sWUFDRTtBQUFBLE1BQ0YsaUJBQWlCO0FBQUEsUUFDZixjQUFjO0FBQUEsUUFDZCxvQkFBb0I7QUFBQSxNQUN0QjtBQUFBLE1BQ0Esa0JBQWtCLEtBQUssU0FBUyxZQUFZO0FBQUEsUUFDMUMsY0FBYztBQUFBLFFBQ2QsUUFBUTtBQUFBLE1BQ1YsQ0FBQztBQUFBLElBQ0g7QUFBQSxJQUNBLFdBQVc7QUFBQSxNQUNULFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2Ysb0JBQW9CO0FBQUEsTUFDdEI7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLFNBQVM7QUFBQSxNQUNYLENBQUM7QUFBQSxNQUNELHFDQUFxQztBQUFBLElBQ3ZDO0FBQUEsRUFDRjtBQUdBLFFBQU0sY0FBYztBQUFBLElBQ2xCLFdBQVc7QUFBQSxJQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNLE1BQU07QUFBQSxNQUNoQyxJQUFJLG1CQUFtQixNQUFNLE1BQU07QUFBQSxJQUNyQyxDQUFDO0FBQUEsSUFDRCxRQUFRO0FBQUEsTUFDTixZQUNFO0FBQUEsTUFDRixpQkFBaUI7QUFBQSxRQUNmLGNBQWM7QUFBQSxRQUNkLFdBQVc7QUFBQSxNQUNiO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxjQUFjO0FBQUEsUUFDZCxjQUFjLENBQUM7QUFBQSxRQUNmLGNBQWMsQ0FBQyxPQUFPO0FBQUEsTUFDeEIsQ0FBQztBQUFBLElBQ0g7QUFBQSxJQUNBLFdBQVc7QUFBQSxNQUNULFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2YsV0FBVztBQUFBLE1BQ2I7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLFdBQVcsU0FBUztBQUFBLE1BQ3RCLENBQUM7QUFBQSxNQUNELHFDQUFxQztBQUFBLElBQ3ZDO0FBQUEsRUFDRjtBQUdBLFVBQVEsTUFBTSxZQUFZO0FBQzFCLFVBQVEsTUFBTSxRQUFRO0FBRXRCLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLGVBQWUsQ0FBQyxXQUFXLFVBQVUsV0FBVztBQUFBLEVBQ2xEO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBMkI7QUFDbEQsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBR0EsU0FBTztBQUFBLElBQ0wsV0FBVyxRQUFRLE1BQU07QUFBQSxJQUN6QixPQUFPLFFBQVEsTUFBTTtBQUFBLEVBQ3ZCO0FBQ0Y7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT
        id                        = "tfiz6mnf2nhyzpzkwm554sir5q-mtrvona5g5g3bloziirrapvpw4"
        name                      = "requestAssetUpload"
#        (10 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_appsync_graphql_api.graphql will be updated in-place
!~  resource "aws_appsync_graphql_api" "graphql" {
        id                            = "tfiz6mnf2nhyzpzkwm554sir5q"
        name                          = "Wildsea-primary"
!~      schema                        = <<-EOT
            scalar AWSTime
            scalar AWSDateTime
            scalar AWSTimestamp
            scalar AWSEmail
            scalar AWSJSON
            scalar AWSURL
            scalar AWSPhone
            scalar AWSIPAddress
            
            directive @aws_subscribe(mutations: [String!]!) on FIELD_DEFINITION
            directive @aws_auth(cognito_groups: [String!]!) on FIELD_DEFINITION
            directive @aws_api_key on FIELD_DEFINITION | OBJECT
            directive @aws_iam on FIELD_DEFINITION | OBJECT
            directive @aws_oidc on FIELD_DEFINITION | OBJECT
            directive @aws_cognito_user_pools(
              cognito_groups: [String!]
            ) on FIELD_DEFINITION | OBJECT
            
            type Mutation {
                createGame(input: CreateGameInput!): GameSummary! @aws_cognito_user_pools(cognito_groups: ["CreateGame"])
                joinGame(input: JoinGameInput!): PlayerSheetSummary! @aws_cognito_user_pools
                updateGame(input: UpdateGameInput!): GameSummary! @aws_cognito_user_pools
                deleteGame(input: DeleteGameInput!): GameSummary! @aws_cognito_user_pools
                updateJoinCode(input: UpdateJoinCodeInput!): GameSummary! @aws_cognito_user_pools
                createSection(input: CreateSectionInput!): SheetSection! @aws_cognito_user_pools
                updateSection(input: UpdateSectionInput!): SheetSection! @aws_cognito_user_pools
                deleteSection(input: DeleteSectionInput!): SheetSection! @aws_cognito_user_pools
                updatePlayer(input: UpdatePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools
                deletePlayer(input: DeletePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools @aws_iam
                createNPC(input: CreateNPCInput!): PlayerSheetSummary! @aws_cognito_user_pools
                rollDice(input: RollDiceInput!): DiceRoll! @aws_cognito_user_pools
                updateUserSettings(input: UpdateUserSettingsInput!): UserSettings! @aws_cognito_user_pools
                setSystemNotification(input: SetSystemNotificationInput!): SystemNotification! @aws_iam
                requestAssetUpload(input: RequestAssetUploadInput!): AssetUploadTicket! @aws_cognito_user_pools
                _expireAsset(input: ExpireAssetInput!): Asset! @aws_iam
                _finaliseAsset(input: FinaliseAssetInput!): Asset! @aws_iam
          +     _promoteAsset(input: PromoteAssetInput!): Asset! @aws_iam
                deleteAsset(input: DeleteAssetInput!): Asset! @aws_cognito_user_pools @aws_iam
            }
            
            type GamesWithQuota @aws_cognito_user_pools {
              games: [PlayerSheetSummary!]!
              remainingGames: Int!
              totalQuota: Int!
            }
            
            type Query {
                getGame(input: GetGameInput!): Game! @aws_cognito_user_pools
                getGames: GamesWithQuota! @aws_cognito_user_pools
                getGameTypes(input: GetGameTypesInput!): [GameTypeMetadata!]! @aws_cognito_user_pools
                getCharacterTemplates(input: GetCharacterTemplatesInput!): [CharacterTemplateMetadata!]! @aws_cognito_user_pools
                getCharacterTemplate(input: GetCharacterTemplateInput!): [TemplateSectionData!]! @aws_cognito_user_pools
                getGamePresets(input: GetGamePresetsInput!): [GamePresetItem!]! @aws_cognito_user_pools
                getUserSettings: UserSettings @aws_cognito_user_pools
                getSystemNotification: SystemNotification @aws_cognito_user_pools
            }
            
            type Subscription @aws_cognito_user_pools {
              updatedPlayer(gameId: ID!): PlayerSheetSummary @aws_subscribe(mutations: ["updatePlayer", "deletePlayer", "createNPC", "joinGame"])
              updatedSection(gameId: ID!): SheetSection @aws_subscribe(mutations: ["createSection", "updateSection", "deleteSection"])
              updatedGame(gameId: ID!): GameSummary @aws_subscribe(mutations: ["updateGame", "deleteGame", "updateJoinCode"])
              diceRolled(gameId: ID!): DiceRoll @aws_subscribe(mutations: ["rollDice"])
              updatedUserSettings: UserSettings @aws_subscribe(mutations: ["updateUserSettings"])
              systemNotificationUpdated: SystemNotification @aws_subscribe(mutations: ["setSystemNotification"])
          -   updatedAsset(gameId: ID!): Asset @aws_subscribe(mutations: ["_expireAsset", "_finaliseAsset", "deleteAsset"])
          +   updatedAsset(gameId: ID!): Asset @aws_subscribe(mutations: ["_expireAsset", "_finaliseAsset", "_promoteAsset", "deleteAsset"])
            }
            
            input GetGameInput {
              gameId: ID!
              language: String!
            }
            
            input GetGameTypesInput {
              language: String!
            }
            
            input GetCharacterTemplatesInput {
              gameType: String!
              language: String!
            }
            
            input GetCharacterTemplateInput {
              templateName: String!
              gameType: String!
              language: String!
            }
            
            input GetGamePresetsInput {
              dataSetName: String!
              language: String!
            }
            
            input CreateGameInput {
                name: String!
                gameType: String!
                description: String
                language: String!
            }
            
            input JoinGameInput {
              joinCode: String!
              language: String!
            }
            
            input DeleteGameInput {
              gameId: ID!
            }
            
            input UpdateGameInput {
              gameId: ID!
              name: String!
              description: String
            }
            
            input UpdateJoinCodeInput {
              gameId: ID!
            }
            
            input DeletePlayerInput {
              gameId: ID!
              userId: ID!
            }
            
            input CreateSectionInput {
              userId: ID
              gameId: ID!
              sectionName: String!
              sectionType: String!
              content: AWSJSON
              position: Int!
            }
            
            input UpdateSectionInput {
              gameId: ID!
              sectionId: ID!
              sectionName: String
              content: AWSJSON
              position: Int
            }
            
            input DeleteSectionInput {
              gameId: ID!
              sectionId: ID!
            }
            
            type GameSummary @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              joinCode: String
              gmUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
              theme: String
              remainingCharacters: Int!
              remainingSections: Int!
              remainingAssets: Int!
            }
            
            type Game @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              playerSheets: [PlayerSheet!]!
              joinCode: String
              gmUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
              theme: String
              remainingCharacters: Int!
              remainingSections: Int!
              remainingAssets: Int!
            }
            
            input UpdatePlayerInput {
              gameId: ID!
              userId: ID!
              characterName: String!
            }
            
            input CreateNPCInput {
              gameId: ID!
              characterName: String!
            }
            
            type PlayerSheetSummary @aws_cognito_user_pools @aws_iam {
              userId: ID!
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              characterName: String!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
              remainingSections: Int!
            }
            
            type PlayerSheet @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              characterName: String!
              sections: [SheetSection!]!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              gmUserId: ID!
              remainingSections: Int!
            }
            
            type SheetSection @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              sectionId: ID!
              type: String!
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
              assets: [String!]
            }
            
            union Dice = SingleDie
            
            input DiceInput {
              type: String!
              size: Int!
              modifier: Int
            }
            
            input RollDiceInput {
              gameId: ID!
              dice: [DiceInput!]!
              action: String
              rollType: String!
              target: Int!
              onBehalfOf: ID
              messageType: String
            }
            
            type DiceRoll @aws_cognito_user_pools {
              gameId: ID!
              playerId: ID!
              playerName: String!
              dice: [Dice!]!
              rollType: String!
              target: Int!
              grade: String!
              action: String
              diceList: [Dice!]!
              value: Int!
              rolledAt: AWSDateTime!
              rolledBy: String!
              proxyRoll: Boolean!
              type: String!
              messageIndex: Int!
              messageType: String
            }
            
            type SingleDie @aws_cognito_user_pools {
              type: String!
              size: Int!
              value: Int!
            }
            
            type GameTypeMetadata @aws_cognito_user_pools {
              gameType: String!
              displayName: String!
              language: String!
            }
            
            type CharacterTemplateMetadata @aws_cognito_user_pools {
              templateName: String!
              displayName: String!
              gameType: String!
              language: String!
            }
            
            type TemplateSectionData @aws_cognito_user_pools {
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
            }
            
            type GamePresetItem @aws_cognito_user_pools {
              displayName: String!
              data: AWSJSON!
              language: String!
            }
            
            type UserSettings @aws_cognito_user_pools {
              userId: ID!
              settings: AWSJSON!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
            }
            
            input UpdateUserSettingsInput {
              settings: AWSJSON!
              language: String!
            }
            
            input SetSystemNotificationInput {
              message: String
              urgent: Boolean
            }
            
            type SystemNotification @aws_cognito_user_pools @aws_iam {
              message: String
              urgent: Boolean!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
            }
            
            type Asset @aws_cognito_user_pools @aws_iam {
              gameId: ID!
              sectionId: ID!
              assetId: ID!
              label: String
              status: AssetStatus!
              mimeType: String!
              sizeBytes: Int
              width: Int
              height: Int
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
            }
            
            enum AssetStatus {
              PENDING
          +   FINALISING
              READY
              EXPIRED
              CANCELED
            }
            
            type AssetUploadTicket @aws_cognito_user_pools {
              asset: Asset!
              uploadUrl: AWSURL!
              uploadFields: AWSJSON!
              headers: AWSJSON!
            }
            
            input RequestAssetUploadInput {
              gameId: ID!
              sectionId: ID!
              mimeType: String!
              sizeBytes: Int!
              label: String
            }
            
            input ExpireAssetInput {
              gameId: ID!
              assetId: ID!
            }
            
            input FinaliseAssetInput {
              gameId: ID!
              assetId: ID!
              sectionId: ID!
            }
            
          + input PromoteAssetInput {
          +   gameId: ID!
          +   assetId: ID!
          + }
          + 
            input DeleteAssetInput {
              gameId: ID!
              sectionId: ID!
              assetId: ID!
            }
        EOT
        tags                          = {
            "Name" = "Wildsea-primary"
        }
#        (12 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.wildsea.aws_appsync_resolver.resolver["_expireAsset"] will be updated in-place
!~  resource "aws_appsync_resolver" "resolver" {
!~      code              = <<-EOT
            // mutation/_expireAsset/_expireAsset.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixAsset = "ASSET";
            
            // lib/constants/assetStatus.ts
            var ASSET_STATUS_PENDING = "PENDING";
            var ASSET_STATUS_EXPIRED = "EXPIRED";
            
            // mutation/_expireAsset/_expireAsset.ts
            function request(context) {
              const input = context.arguments.input;
              const timestamp = util.time.nowISO8601();
              return {
                operation: "UpdateItem",
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + input.gameId,
                  SK: DDBPrefixAsset + "#" + input.assetId
                }),
                update: {
                  expression: "SET #status = :expired, #updatedAt = :updatedAt",
                  expressionNames: {
                    "#status": "status",
                    "#updatedAt": "updatedAt"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":expired": ASSET_STATUS_EXPIRED,
                    ":updatedAt": timestamp
                  })
                },
                condition: {
                  expression: "#status = :pending",
                  expressionNames: {
                    "#status": "status"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":pending": ASSET_STATUS_PENDING
                  })
                }
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return context.result;
            }
            export {
              request,
              response
            };
          - //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiX2V4cGlyZUFzc2V0LnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZGJQcmVmaXhlcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2Fzc2V0U3RhdHVzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBcUI7OztBQ0F2QixJQUFNLGdCQUFnQjtBQVl0QixJQUFNLGlCQUFpQjs7O0FDWHZCLElBQU0sdUJBQXVCO0FBRTdCLElBQU0sdUJBQXVCOzs7QUZNN0IsU0FBUyxRQUNkLFNBQzJCO0FBQzNCLFFBQU0sUUFBUSxRQUFRLFVBQVU7QUFDaEMsUUFBTSxZQUFZLEtBQUssS0FBSyxXQUFXO0FBRXZDLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNLE1BQU07QUFBQSxNQUNoQyxJQUFJLGlCQUFpQixNQUFNLE1BQU07QUFBQSxJQUNuQyxDQUFDO0FBQUEsSUFDRCxRQUFRO0FBQUEsTUFDTixZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLFdBQVc7QUFBQSxRQUNYLGNBQWM7QUFBQSxNQUNoQjtBQUFBLE1BQ0Esa0JBQWtCLEtBQUssU0FBUyxZQUFZO0FBQUEsUUFDMUMsWUFBWTtBQUFBLFFBQ1osY0FBYztBQUFBLE1BQ2hCLENBQUM7QUFBQSxJQUNIO0FBQUEsSUFDQSxXQUFXO0FBQUEsTUFDVCxZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLFdBQVc7QUFBQSxNQUNiO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxZQUFZO0FBQUEsTUFDZCxDQUFDO0FBQUEsSUFDSDtBQUFBLEVBQ0Y7QUFDRjtBQUVPLFNBQVMsU0FBUyxTQUEyQjtBQUNsRCxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQUEsRUFDdEU7QUFFQSxTQUFPLFFBQVE7QUFDakI7IiwKICAibmFtZXMiOiBbXQp9Cg==
          + //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiX2V4cGlyZUFzc2V0LnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZGJQcmVmaXhlcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2Fzc2V0U3RhdHVzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBcUI7OztBQ0F2QixJQUFNLGdCQUFnQjtBQVl0QixJQUFNLGlCQUFpQjs7O0FDWHZCLElBQU0sdUJBQXVCO0FBRzdCLElBQU0sdUJBQXVCOzs7QUZLN0IsU0FBUyxRQUNkLFNBQzJCO0FBQzNCLFFBQU0sUUFBUSxRQUFRLFVBQVU7QUFDaEMsUUFBTSxZQUFZLEtBQUssS0FBSyxXQUFXO0FBRXZDLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNLE1BQU07QUFBQSxNQUNoQyxJQUFJLGlCQUFpQixNQUFNLE1BQU07QUFBQSxJQUNuQyxDQUFDO0FBQUEsSUFDRCxRQUFRO0FBQUEsTUFDTixZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLFdBQVc7QUFBQSxRQUNYLGNBQWM7QUFBQSxNQUNoQjtBQUFBLE1BQ0Esa0JBQWtCLEtBQUssU0FBUyxZQUFZO0FBQUEsUUFDMUMsWUFBWTtBQUFBLFFBQ1osY0FBYztBQUFBLE1BQ2hCLENBQUM7QUFBQSxJQUNIO0FBQUEsSUFDQSxXQUFXO0FBQUEsTUFDVCxZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLFdBQVc7QUFBQSxNQUNiO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxZQUFZO0FBQUEsTUFDZCxDQUFDO0FBQUEsSUFDSDtBQUFBLEVBQ0Y7QUFDRjtBQUVPLFNBQVMsU0FBUyxTQUEyQjtBQUNsRCxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQUEsRUFDdEU7QUFFQSxTQUFPLFFBQVE7QUFDakI7IiwKICAibmFtZXMiOiBbXQp9Cg==
        EOT
        id                = "tfiz6mnf2nhyzpzkwm554sir5q-Mutation-_expireAsset"
#        (10 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_appsync_resolver.resolver["_finaliseAsset"] will be updated in-place
!~  resource "aws_appsync_resolver" "resolver" {
!~      code              = <<-EOT
            // mutation/_finaliseAsset/_finaliseAsset.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixAsset = "ASSET";
            
            // lib/constants/assetStatus.ts
            var ASSET_STATUS_PENDING = "PENDING";
          - var ASSET_STATUS_READY = "READY";
          + var ASSET_STATUS_FINALISING = "FINALISING";
            
            // mutation/_finaliseAsset/_finaliseAsset.ts
            function request(context) {
              const input = context.arguments.input;
              const timestamp = util.time.nowISO8601();
              const { gameId, assetId } = input;
              return {
                operation: "UpdateItem",
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + gameId,
                  SK: DDBPrefixAsset + "#" + assetId
                }),
                update: {
          -       expression: "SET #status = :ready, #updatedAt = :updatedAt",
          +       expression: "SET #status = :finalising, #updatedAt = :updatedAt",
                  expressionNames: {
                    "#status": "status",
                    "#updatedAt": "updatedAt"
                  },
                  expressionValues: util.dynamodb.toMapValues({
          -         ":ready": ASSET_STATUS_READY,
          +         ":finalising": ASSET_STATUS_FINALISING,
                    ":updatedAt": timestamp
                  })
                },
                condition: {
                  expression: "#status = :pending",
                  expressionNames: {
                    "#status": "status"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":pending": ASSET_STATUS_PENDING
                  })
                }
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return context.result;
            }
            export {
              request,
              response
            };
          - //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiX2ZpbmFsaXNlQXNzZXQudHMiLCAiLi4vLi4vbGliL2NvbnN0YW50cy9kYlByZWZpeGVzLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvYXNzZXRTdGF0dXMudHMiXSwKICAibWFwcGluZ3MiOiAiO0FBQUEsU0FBUyxZQUFxQjs7O0FDQXZCLElBQU0sZ0JBQWdCO0FBWXRCLElBQU0saUJBQWlCOzs7QUNYdkIsSUFBTSx1QkFBdUI7QUFDN0IsSUFBTSxxQkFBcUI7OztBRk8zQixTQUFTLFFBQ2QsU0FDMkI7QUFDM0IsUUFBTSxRQUFRLFFBQVEsVUFBVTtBQUNoQyxRQUFNLFlBQVksS0FBSyxLQUFLLFdBQVc7QUFFdkMsUUFBTSxFQUFFLFFBQVEsUUFBUSxJQUFJO0FBRTVCLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNO0FBQUEsTUFDMUIsSUFBSSxpQkFBaUIsTUFBTTtBQUFBLElBQzdCLENBQUM7QUFBQSxJQUNELFFBQVE7QUFBQSxNQUNOLFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2YsV0FBVztBQUFBLFFBQ1gsY0FBYztBQUFBLE1BQ2hCO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxVQUFVO0FBQUEsUUFDVixjQUFjO0FBQUEsTUFDaEIsQ0FBQztBQUFBLElBQ0g7QUFBQSxJQUNBLFdBQVc7QUFBQSxNQUNULFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2YsV0FBVztBQUFBLE1BQ2I7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLFlBQVk7QUFBQSxNQUNkLENBQUM7QUFBQSxJQUNIO0FBQUEsRUFDRjtBQUNGO0FBRU8sU0FBUyxTQUFTLFNBQTJCO0FBQ2xELE1BQUksUUFBUSxPQUFPO0FBQ2pCLFNBQUssTUFBTSxRQUFRLE1BQU0sU0FBUyxRQUFRLE1BQU0sTUFBTSxRQUFRLE1BQU07QUFBQSxFQUN0RTtBQUVBLFNBQU8sUUFBUTtBQUNqQjsiLAogICJuYW1lcyI6IFtdCn0K
          + //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiX2ZpbmFsaXNlQXNzZXQudHMiLCAiLi4vLi4vbGliL2NvbnN0YW50cy9kYlByZWZpeGVzLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvYXNzZXRTdGF0dXMudHMiXSwKICAibWFwcGluZ3MiOiAiO0FBQUEsU0FBUyxZQUFxQjs7O0FDQXZCLElBQU0sZ0JBQWdCO0FBWXRCLElBQU0saUJBQWlCOzs7QUNYdkIsSUFBTSx1QkFBdUI7QUFDN0IsSUFBTSwwQkFBMEI7OztBRk9oQyxTQUFTLFFBQ2QsU0FDMkI7QUFDM0IsUUFBTSxRQUFRLFFBQVEsVUFBVTtBQUNoQyxRQUFNLFlBQVksS0FBSyxLQUFLLFdBQVc7QUFFdkMsUUFBTSxFQUFFLFFBQVEsUUFBUSxJQUFJO0FBRTVCLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNO0FBQUEsTUFDMUIsSUFBSSxpQkFBaUIsTUFBTTtBQUFBLElBQzdCLENBQUM7QUFBQSxJQUNELFFBQVE7QUFBQSxNQUNOLFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2YsV0FBVztBQUFBLFFBQ1gsY0FBYztBQUFBLE1BQ2hCO0FBQUEsTUFDQSxrQkFBa0IsS0FBSyxTQUFTLFlBQVk7QUFBQSxRQUMxQyxlQUFlO0FBQUEsUUFDZixjQUFjO0FBQUEsTUFDaEIsQ0FBQztBQUFBLElBQ0g7QUFBQSxJQUNBLFdBQVc7QUFBQSxNQUNULFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2YsV0FBVztBQUFBLE1BQ2I7QUFBQSxNQUNBLGtCQUFrQixLQUFLLFNBQVMsWUFBWTtBQUFBLFFBQzFDLFlBQVk7QUFBQSxNQUNkLENBQUM7QUFBQSxJQUNIO0FBQUEsRUFDRjtBQUNGO0FBRU8sU0FBUyxTQUFTLFNBQTJCO0FBQ2xELE1BQUksUUFBUSxPQUFPO0FBQ2pCLFNBQUssTUFBTSxRQUFRLE1BQU0sU0FBUyxRQUFRLE1BQU0sTUFBTSxRQUFRLE1BQU07QUFBQSxFQUN0RTtBQUVBLFNBQU8sUUFBUTtBQUNqQjsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
        id                = "tfiz6mnf2nhyzpzkwm554sir5q-Mutation-_finaliseAsset"
#        (10 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_appsync_resolver.resolver["_promoteAsset"] will be created
+   resource "aws_appsync_resolver" "resolver" {
+       api_id      = "**************************"
+       arn         = (known after apply)
+       code        = <<-EOT
            // mutation/_promoteAsset/_promoteAsset.ts
            import { util } from "@aws-appsync/utils";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixAsset = "ASSET";
            
            // lib/constants/assetStatus.ts
            var ASSET_STATUS_FINALISING = "FINALISING";
            var ASSET_STATUS_READY = "READY";
            
            // mutation/_promoteAsset/_promoteAsset.ts
            function request(context) {
              const input = context.arguments.input;
              const timestamp = util.time.nowISO8601();
              const { gameId, assetId } = input;
              return {
                operation: "UpdateItem",
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + gameId,
                  SK: DDBPrefixAsset + "#" + assetId
                }),
                update: {
                  expression: "SET #status = :ready, #updatedAt = :updatedAt",
                  expressionNames: {
                    "#status": "status",
                    "#updatedAt": "updatedAt"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":ready": ASSET_STATUS_READY,
                    ":updatedAt": timestamp
                  })
                },
                condition: {
                  expression: "#status = :finalising",
                  expressionNames: {
                    "#status": "status"
                  },
                  expressionValues: util.dynamodb.toMapValues({
                    ":finalising": ASSET_STATUS_FINALISING
                  })
                }
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return context.result;
            }
            export {
              request,
              response
            };
Plan is too large to fit in a PR comment. See the full plan in the workflow log.
```
</details>

:memo: Plan generated in [Environment Main - Plan #1881](https://github.com/jarrod-lowe/wildsea/actions/runs/18253958261)